Autodesk.Revit.DB.ExtrusionRoof.CurtainGrids
Retrieve all the CurtainGrid objects of a curtain Roof.
Remarks: Only when the object is a CurtainRoof, this property makes sense.

Autodesk.Revit.DB.ExtrusionRoof.GetProfile
Retrieve the Profile of ExtrusionRoof.

Autodesk.Revit.DB.ExtrusionRoof
Represents some kinds of Extrusion Roofs.
Remarks: The ExtrusionRoof object represents some kinds of extruded roofs in Revit.